SUBJECTS = {
    1: "Математика",
    2: "Физика",
    3: "Информатика",
    4: "Химия",
    5: "Английский",
    6: "Литература",
    7: "Биология",
    8: "История",
    9: "Обществознание",
    10: "География"
}

SUBJECT_SECTIONS = {
    1: {
        101: "Алгебра",
        102: "Геометрия",
        103: "Мат. анализ",
        104: "Дискретная математика",
        105: "Теория вероятностей",
        106: "ТФКП",
        107: "Вычислительная математика",
        108: "Статистика",
        199: "Другое"
    },
    2: {
        201: "Механика",
        202: "Термодинамика",
        203: "Электродинамика",
        204: "Оптика",
        205: "Квантовая физика",
        299: "Другое"
    },
    3: {
        301: "Программирование",
        302: "Алгоритмы",
        303: "Базы данных",
        304: "Искусственный интеллект",
        305: "Кибербезопасность",
        306: "Machine Learning",
        399: "Другое"
    },
    4: {
        401: "Неорганическая химия",
        402: "Органическая химия",
        403: "Физическая химия",
        404: "Биохимия",
        499: "Другое"
    },
    5: {
        501: "Грамматика",
        502: "Лексика",
        503: "Письменная речь",
        599: "Другое"
    },
    6: {
        601: "Художественная литература",
        602: "Научная литература",
        603: "Техническая литература",
        604: "Учебная литература",
        699: "Другое"
    },
    7: {
        701: "Генетика",
        702: "Цитология",
        703: "Экология",
        704: "Гистология",
        705: "Анатомия",
        706: "Эволюционная биология",
        707: "Биология развития",
        799: "Другое"
    },
    8: {
        801: "Первобытная история",
        802: "Древний мир",
        803: "Средневековье",
        804: "Новое время",
        805: "Новейшее время",
        899: "Другое"
    },
    9: {
        901: "Человек и общество",
        902: "Экономика",
        903: "Социальные отношения",
        904: "Политика",
        905: "Право",
        906: "Духовная культура",
        999: "Другое"
    },
    10: {
        1001: "Физическая география",
        1099: "Другое"
    }
}